$(document).ready (function () {
	generateTask();
	$( "#select_act" ).change(function() {
		if ($(this).val() == 1) {
			act = 1;
			generateTask();
			$(".form-check").css("background-color", "white");
			$(".acts").css ("display", "none");
			$("#act_1").css ("display", "block");
		};
		if ($(this).val() == 2) {
			act = 2;
			generateTask();
			$(".form-check").css("background-color", "white");
			$(".acts").css ("display", "none");
			$("#act_1").css ("display", "block");
			$("#act_2").css ("display", "block");
		};
		if ($(this).val() == 3) {
			act = 3;
			generateTask();
			$(".form-check").css("background-color", "white");
			$(".acts").css ("display", "block");
		};
	});

	$( "#check" ).click(function() {
		if (act == 1) {
			for (i = 0; i <= 3; i++){
				if ($("#act_1_"+i).prop("checked")) {
					if ($("#act_1_"+i).val() == answer_1){
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
		} else if (act == 2){
			for (i = 0; i <= 3; i++){
				if ($("#act_1_"+i).prop("checked")) {
					if ($("#act_1_"+i).val() == answer_1){
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
			for (i = 0; i <= 3; i++){
				if ($("#act_2_"+i).prop("checked")) {
					if ($("#act_2_"+i).val() == answer_2){
						$("#act_2_"+i).parent().parent().children().css("background-color", "white");
						$("#act_2_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_2_"+i).parent().parent().children().css("background-color", "white");
						$("#act_2_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
		} else if (act == 3) {
			for (i = 0; i <= 3; i++){
				if ($("#act_1_"+i).prop("checked")) {
					if ($("#act_1_"+i).val() == answer_1){
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_1_"+i).parent().parent().children().css("background-color", "white");
						$("#act_1_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
			for (i = 0; i <= 3; i++){
				if ($("#act_2_"+i).prop("checked")) {
					if ($("#act_2_"+i).val() == answer_2){
						$("#act_2_"+i).parent().parent().children().css("background-color", "white");
						$("#act_2_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_2_"+i).parent().parent().children().css("background-color", "white");
						$("#act_2_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
			for (i = 0; i <= 3; i++){
				if ($("#act_3_"+i).prop("checked")) {
					if ($("#act_3_"+i).val() == answer_3){
						$("#act_3_"+i).parent().parent().children().css("background-color", "white");
						$("#act_3_"+i).parent().css("background-color", "#addfad");
					} else {
						$("#act_3_"+i).parent().parent().children().css("background-color", "white");
						$("#act_3_"+i).parent().css("background-color", "#FA8072");
					}
				}
			}
		}
	});

	$( "#next" ).click(function() {
		$(".form-check").css("background-color", "white");
		generateTask();
	});
});
var act = 3;
var answer_1;
var answer_2;
var answer_3;
var acts = [];

function generateTask () {
	var textTask = "";
	var last = "";
	par_3 = 0;
	str = eval("T" + act)[getRandomInt(0,eval("T" + act).length)];
	res = str.split("$");
	for (var i = 0; i < res.length-1; i++) {
		if (res[i].indexOf("w1", 0) >= 0){
			if (typeof w1 == "undefined") {
				var w1 = getRandomInt(1,res[i].split(",").length);
			}
			if (res[i].split(",")[w1].indexOf("_", 0) >=0) {
				if ((last % 10 == 1) && (parseInt(last / 10) != 1)) {
					textTask += res[i].split(",")[w1].split("_")[0];
				} else if ((last % 10 == 2 || last % 10 == 3 || last % 10 == 4) && (parseInt(last / 10) != 1)){
					textTask += res[i].split(",")[w1].split("_")[1];
				} else {
					textTask += res[i].split(",")[w1].split("_")[2];
				}
			} else {
				textTask += res[i].split(",")[w1];
			} 
		} else if (!res[i].indexOf("w2", 0)) {
			if (typeof w2 == "undefined") {
				var w2 = getRandomInt(1,res[i].split(",").length);
			}
			if (res[i].split(",")[w2].indexOf("_", 0) >=0) {
				if ((last % 10 == 1) && (parseInt(last / 10) != 1)) {
					textTask += res[i].split(",")[w2].split("_")[0];
				} else if ((last % 10 == 2 || last % 10 == 3 || last % 10 == 4) && (parseInt(last / 10) != 1)){
					textTask += res[i].split(",")[w2].split("_")[1];
				} else {
					textTask += res[i].split(",")[w2].split("_")[2];
				}
			} else {
				textTask += res[i].split(",")[w2];
			} 
		} else if (!res[i].indexOf("w3", 0)) {
			if (typeof w3 == "undefined") {
				var w3 = getRandomInt(1,res[i].split(",").length);
			}
			if (res[i].split(",")[w3].indexOf("_", 0) >=0) {
				if ((last % 10 == 1) && (parseInt(last / 10) != 1)) {
					textTask += res[i].split(",")[w3].split("_")[0];
				} else if ((last % 10 == 2 || last % 10 == 3 || last % 10 == 4) && (parseInt(last / 10) != 1)){
					textTask += res[i].split(",")[w3].split("_")[1];
				} else {
					textTask += res[i].split(",")[w3].split("_")[2];
				}
			} else {
				textTask += res[i].split(",")[w3];
			} 
		} else if (!res[i].indexOf("v1", 0)) {
			if (typeof v1 == "undefined") {
				var v1 = getRandomInt(1,res[i].split(",").length);
			}
			last = res[i].split(",")[v1];
			par_1 = res[i].split(",")[v1];
			textTask += res[i].split(",")[v1];
		} else if (!res[i].indexOf("v2", 0)) {
			if (typeof v2 == "undefined") {
				var v2 = getRandomInt(1,res[i].split(",").length);
			}
			last = res[i].split(",")[v2];
			par_2 = res[i].split(",")[v2];
			textTask += res[i].split(",")[v2];
		} else if (!res[i].indexOf("v3", 0)) {;
			if (typeof v3 == "undefined") {
				var v3 = getRandomInt(1,res[i].split(",").length);
			}
			last = res[i].split(",")[v3];
			par_3 = res[i].split(",")[v3];
			textTask += res[i].split(",")[v3];
		} else if (!res[i].indexOf("a", 0)){
			var a = getRandomInt(1,res[i].split(",").length);
			if (res[i].split(",")[a].indexOf("_", 0) >=0) {
				if ((last % 10 == 1) && (parseInt(last / 10) != 1)) {
					textTask += res[i].split(",")[a].split("_")[0];
				} else if ((last % 10 == 2 || last % 10 == 3 || last % 10 == 4) && (parseInt(last / 10) != 1)){
					textTask += res[i].split(",")[a].split("_")[1];
				} else {
					textTask += res[i].split(",")[a].split("_")[2];
				}
			} else {
				textTask += res[i].split(",")[a];
			} 
		} else {
			textTask += res[i];
		}
	}
	$("#textTask").html (textTask);
	generateAct (par_1,par_2,par_3,res[res.length-1]);
}

function generateAct (par_1, par_2, par_3, sign) {
	if (act == 1){
		textAct = par_1 + " " + sign + " " + par_2 + " = ";
		par_1 = Number(par_1);
		par_2 = Number(par_2);
		textAct += (eval(par_1 + sign + par_2));
		answer_1 = getRandomInt(0,4);
		fakeAct(answer_1,textAct, 1);
	} else if (act == 2){
		textAct = par_1 + " " + sign[0] + " " + par_2 + " = ";
		par_1 = Number(par_1);
		par_2 = Number(par_2);
		textAct += (eval(par_1 + sign[0] + par_2));
		answer_1 = getRandomInt(0,4);
		fakeAct(answer_1,textAct, 1);
		if (sign[3] == '2' && sign[6] == '3'){
			textAct = eval(par_1 + sign[0] + par_2) + " " + sign[4] + " " + par_3 + " = ";
			textAct += eval(eval(par_1 + sign[0] + par_2) + sign[4] + par_3);
			answer_2 = getRandomInt(0,4);
			fakeAct(answer_2,textAct, 2);
		} else {
			textAct = par_1 + " " + sign[4] + " " + eval(par_1 + sign[0] + par_2) + " = ";
			textAct += eval(par_1 + sign[4] + eval(par_1 + sign[0] + par_2));
			answer_2 = getRandomInt(0,4);
			fakeAct(answer_2,textAct, 2);	
		}
	} else {
		textAct = par_1 + " " + sign[0] + " " + par_2 + " = ";
		par_1 = Number(par_1);
		par_2 = Number(par_2);
		textAct += (eval(par_1 + sign[0] + par_2));
		answer_1 = getRandomInt(0,3);
		fakeAct(answer_1,textAct, 1);
		if (sign[3] == '2' && sign[6] == '3'){
			textAct = eval(par_1 + sign[0] + par_2) + " " + sign[4] + " " + par_3 + " = ";
			textAct += eval(eval(par_1 + sign[0] + par_2) + sign[4] + par_3);
			answer_2 = getRandomInt(0,4);
			fakeAct(answer_2,textAct, 2);
			textAct = par_1+ " " + sign[8]+ " " + eval(par_1 + sign[0] + par_2) + " " + sign[9] + " " + eval(eval(par_1 + sign[0] + par_2) + sign[4] + par_3) + " = ";
			textAct += eval(par_1 + sign[8] + eval(par_1 + sign[0] + par_2) + sign[9] + eval(par_1 + sign[0] + par_2) + sign[4] + par_3);
			answer_3 = getRandomInt(0,4);
			fakeAct(answer_3,textAct, 3);
		} else if (sign[2] == "-"){
			textAct = par_3 + " " + sign[2] + " " + par_1 + " = ";
			textAct += eval(par_3 + sign[2] + par_1);
			answer_2 = getRandomInt(0,3);
			fakeAct(answer_2,textAct, 2);
			textAct = eval(par_3 + sign[2] + par_1)+ " " + sign[4]+ " " + eval(par_1 + sign[0] + par_2) + " = ";
			textAct += eval(eval(par_3 + sign[2] + par_1) + sign[4] + eval(par_1 + sign[0] + par_2));
			answer_3 = getRandomInt(0,4);
			fakeAct(answer_3,textAct, 3);	
		}
	}
}

function fakeAct(indexAnswer, textAct, z){
	for (i = 0; i <= 3; i++){
		if (i != indexAnswer) {
			if (getRandomInt(0,2) == 1){
				sign = "+";
			} else {
				sign = "-";
			}
			x = getRandomInt(0,60);
			y = getRandomInt(0,60);
			acts[i] = x + " " + sign + " " + y + " = " + eval(x + sign + y);
		}
	}
	acts[indexAnswer] = textAct;
	for (var i = 0; i <= 3; i++) {
		$("#act_"+ z + "_" +i).parent().find("label").html(acts[i]);
	}
}

function getRandomInt(min, max) {
	return Math.floor(Math.random() * (max - min)) + min;
}

//Задачи в одно действие

var T1 = [

"$w1,На верхней полке, В шкафу, В магазине, На складе $ было $v1,5,6,7,8,9,10,11,12,13$ $w2,книг,шляп,игрушек,коробок,папок,машинок,тетрадок,мячей,фонариков$. А $w1,на нижней полке,в другом шкафу,в другом магазине,на другом складе $ было на $v2,5,6,7,8,9,10 $ $w2,книг,шляп,игрушек,коробок,папок,машинок,тетрадок,мячей,фонариков$ больше. Сколько $w2,книг,шляп,игрушек,коробок,папок,машинок,тетрадей,мячей,фонариков$, было $w1,на нижней полке, в другом шкафу, в другом магазине, на другом складе$?$+",

"$w1,Брату,Мише,Толе,Ване,Саше,Мише,Паше,Антону,Андрею,Дане$ $v1,10,11,12,13,14,15,16,17,18,19,20$ лет, а $w2,сестра,Даша, Марина,Катя,Ирина,Полина,Оля$ на $v2,5,6,7,8,9,10$ лет старше. Сколько лет $w2,сестре,Даше,Марине,Кате,Ирине,Полине,Оле$?$+",

"У $w1,Толи,Вани,Саши,Миши,Паши,Антона,Андрея,Дани$ $v1,5,6,7,8,9,10,11,12,18,19$ $w2,яблок,персиков,апельсинов,груш,слив,абрикосов,бананов,лимонов$, а у $w3,Даши,Марины,Кати,Ирины,Полины,Оли,Ксюши,Сони$ на $v2,5,6,7,8,9,10$  $w2,яблок,персиков,апельсинов,груш,слив,абрикосов,бананов,лимонов$ больше. Сколько $w2,яблок,персиков,апельсинов,груш,слив,абрикосов,бананов,лимонов$ у $w3,Даши,Марины,Кати,Ирины,Полины,Оли,Ксюши,Сони$?$+",

"В одном классе $v1,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15$  $w1,отличник_отличника_отличников, хорошист_хорошиста_хорошистов, ударник_ударника_ударников, двоечник_двоечника_двоечников$, а в другом - $v2,1,2,3,4,5,6,7,8,9$. Сколько $w1,отличников, хорошистов, ударников, двоечников$ в двух классах?$+",

"В $w1,коробке,пачке,банке$ находится $v1,2,3,4,5,10,11,12,13,14,15,16,17,18,19,20$ $w2,конфета_конфеты_конфет,яблоко_яблока_яблок,персик_персика_персиков$. $v2,1,2,4,5,6,7,8$  $w2,конфету_конфеты_конфет,яблоко_яблока_яблок,персик_персика_персиков$ съели. Сколько $w2,конфет,яблок,персиков$ стало в $w1,коробке,пачке,банке$?$-",

"У $w1,Толи,Вани,Саши,Миши,Паши,Антона,Андрея,Дани$ $v1,1,2,3,4,5,10,11,12,13,14,15,16,17,18,19,20$  $w2,яблоко_яблока_яблок,персик_персика_персиков,апельсин_апельсина_апельсинов,груша_груши_груш$, а у $w3,Даши,Марины,Кати,Ирины,Полины,Оли$ на $v2,1,2,3,4,5,6,7,8,9,10$  $w2,яблоко_яблока_яблок,персик_персика_персиков,апельсин_апельсина_апельсинов,груша_груши_груш$ больше. Сколько фруктов у $w3,Даши,Марины,Кати,Ирины,Полины,Оли$?$+",

"В $w1, инсценировке, концерте, постановке, пьесе, сценке, танце $ участвовало $v1,2,3,4,5,6,7,8,9,10,11,12,13,14,15$  $a,мальчик_мальчика_мальчиков$, а девочек на $v2,3,4,5,6,7,8,9,10$ больше. Сколько девочек участвовало $w1,в инсценировке,в концерте,в постановке,в пьесе,в сценке,в танце$?$+",

"$w1,Мама,Сестра,Тетя,Бабушка$ испекла $v1,1,2,5,4,3,11,12,13,14,15,16,17,18,19,20$  $w2,пирожок_пирожка_пирожков$ с $a,мясом,капустой,картошкой,рыбой$, а с $a,яблоками,вишней,грибами,вареньем$  $v2,2,3,4,5,6,7,8,9,10$  $w2,пирожок_пирожка_пирожков$. Сколько  всего пирожков испекла $w1,мама,сестра,тетя,бабушка$?$+",

"$w1,В одной вазе,В одном букете,На одной клумбе$ было $v1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20$  $w2,астра_астры_астра,роза_розы_роз,гвоздика_гвоздики_гвоздик,тюльпан_тюльпана_тюльпанов,ромашка_ромашеки_ромашек$, а $w1,в другой,в другом,на другой$ на $v2,1,2,3,4,5,6,7,8,9,10$  $w2,астра_астры_астр,роза_розы_роз,гвоздика_гвоздики_гвоздик,тюльпан_тюльпана_тюльпанов,ромашка_ромашеки_ромашек$ больше. Сколько $w2,астр,роз,гвоздик,тюльпанов,ромашек$ было $w1,в другой вазе,в другом букете,на другой клумбе$?$+"

];


//Задачи в два действия

var T2 = [

"$w1,На одной полке,В шкафу,В магазине,На складе$ $v1,5,6,7,8,9,10$  $w2,книга_книги_книг,шляпа_шляпы_шляп,игрушка_игрушки_игрушек,коробка_коробки_коробк,папка_папки_папок$, а $w1,на второй полке,во втором шкафу,во втором магазине,на втором складе$ на $v2,1,2,3,4$  $w2,книгу_книги_книг,шляпу_шляпы_шляп,игрушку_игрушки_игрушек,коробку_коробки_коробок,папку_папки_папок$ больше, а $w1,на третьей полке,в третьем шкафу,в третьем магазине,в третьем складе$ на $v3,1,2,3,4,5$  $w2,книгу_книги_книг,шляпу_шляпы_шляп,игрушку_игрушки_игрушек,коробку_коробки_коробок,папку_папки_папок$ меньше, чем $w1,на второй полке,во втором шкафу,во втором магазине,на втором складе$. Сколько $w2,книг,шляп,игрушек,коробок,папок$ лежало $w1,на третьей полке,в третьем шкафу,в третьем магазине,в третьем складе$?$+,p2-p3",

"$w1,В автобусе,В поезде,В маршрутке,В электричке,В троллейбусе$ $v1,16,17,18,20,21,25,26,27,28,29,30,31,35,36$ человек. На первой остановке вышло $v2,5,6,7$ человек. Сколько человек осталось в автобусе после того, как на третьей остановке вышло $v3,5,6,7,8$ человек?$-,p2-p3",

"В $w1,школьный буфет,школьную столовую,магазин$ привезли несколько подносов с $w2,булочками,шанешками,пиццей,ватрушками,пирожками,рогаликами$. На одном подносе было $v1,2,3,4,5,6,8,9,10$  $w2,булочка_булочки_булочек,шанежка_шанежеки_шанежек,пицца_пиццы_пицц,ватрушка_ватрушки_ватрушек,пирожок_пирожка_пирожков,рогалик_рогалика_рогаликов$, на другом — $v2,10,12,13,15$. За $w3,час,обеденный перерыв,утро,ланч$ было продано $v3,4,5,6,7,8,9,10,11$  $w2,булочка_булочеки_булочек,шанежка_шанежки_шанежек,пицца_пиццы_пицц,ватрушка_ватрушки_ватрушек,пирожок_пирожка_пирожков,рогалик_рогалика_рогаликов$. Сколько $w2,булочек,шанешек,пицц,ватрушек,пирожков,рогаликов$ осталось в $w1,школьном буфете,школьной столовой,магазине$?$+,p2-p3",

"В $w1,понедельник,среду,четверг,пятницу,субботу,воскресенье$ в $w2,музее,галерее,театре,кинотеатре$ побывало $v1,20,25,15,16,17,18,19$  $w3,ученик_ученика_учеников$ из $a,первого,второго,третьего,четвертого$ класса и на $v2,2,3,4,5,6,7,8,9,10,11,12,13$  $w3,ученик_ученика_учеников$ меньше из $a,пятого,шестого,седьмого,восьмого,девятого$ класса. Сколько всего учеников школы побывало в $w2,музее,галерее,театре,кинотеатре$ за $w1,понедельник,среду,четверг,пятницу,субботу,воскресенье$?$-,p1+p3",

"$w1,Оля,Настя,Саша,Ирина,Марина,Полина,Катя,Даша,Надя$ решила нарисовать $v1,62,63,64,52,53,54,42,43,44,72,73,74$  $w2,букета,рисунка,рыбки,облачка$. В первый день она нарисовала $v2,1,2,3,4,5,15,16,17,18,19,20,26,27$  $w2,букет_букета_букетов,рисунок_рисунка_рисунков,рыбку_рыбоки_рыбок,облачко_облачка_облачков$, а в другой - $v3,15,14,13,12,11,10,9,8,7,6,5$. Сколько $w2,букетов,рисунков,рыбок,облачков$ $w1,Оле,Насте,Саше,Ирине,Марине,Полине,Кате,Даше,Наде$ осталось нарисовать?$-,p2-p3",

"В $w1,саду,аллее,парке$ росло $v1,65,66,67,68,69,70,75,76,77,78,79,80$ $w2,дубов,елок,берез$. После урагана оказалось, что $v2,2,3,4,5,6,7$  $w2,дуб_дуба_дубов,елка_елки_елок,береза_березы_берез$ погибли. Тогда посадили еще $v3,8,9,6,10,11,12$  $w2,дуб_дуба_дубов,елка_елки_елок,береза_березы_берез$. Сколько $w2,дубов,елок,берез$ стало в $w1,саду,аллее,парке$?$-,p2+p3",

"$w1,Вера,Света,Катя,Оля$ собирала букет из осенних листьев. Дубовых листочков у нее было $v1,11,10,12,13,14,16,17,18,19$, осиновых — на $v2,2,3,5,6,7,8,4$ больше, а кленовых на $v2,2,3,5,6,7,8,4$ меньше, чем осиновых. Сколько кленовых листочков в $w1,Верином,Светином,Катином,Олином$ букете?$+,p2-p3",

"$w1,Саша,Максим,Семен,Паша,Илья,Ваня$ помогая $a,маме,папе,бабушке,дедушке$, вымыл $v1,2,3,4,5,6,7,8$  $a,тарелку_тарелоки_тарелок$, $v2,1,2,3,4,5,6,7,8,9,10$  $a,вилку_вилоки_вилок$, $v3,1,2,3,4,5,6,7,8,9,10$  $w3,кружку_кружки_кружек$. Сколько всего предметов вымыл $w1,Саша,Максим,Семен,Паша,Илья,Ваня$?$+,p2+p3"

];

//Задачи в три действия

var T3 = [

"Мальчик поймал $v1,20,21,22,23,24,25,26,27$  $w1,карася_карася_карасей$, окуней на $v2,1,3,2,5,7,6,4$ больше, чем карасей, а щук на $v3,1,2,3,5,7,6,8,9$ меньше, чем окуней. Сколько всего рыб поймал мальчик?$+,p2-p3,++",

"$w1,Алла,Наташа,Настя,Оля$ вырезала $v1,2,3,5,7,9,10,11,15,19$  $w2,квадрат_квадрата_квадратов,круг_круга_кругов,треугольник_треугольника_треугольников$, $w3,Стася,Лена,Вера,Лера$ на $v2,22,13,15,17,19,10,12,14,16$  $w2,квадрат_квадрата_квадратов,круг_круга_кругов,треугольник_треугольника_треугольников$ больше, а $a,Вика,Алина,Арина,Таня$ на $v3,2,3,5,7,9,10,11,15,19$  $w2,квадрат_квадрата_квадратов,круг_круга_кругов,треугольник_треугольника_треугольников $ меньше, чем $w3,Стася,Лена,Вера,Лера$. Сколько всего $w2,квадратов,кругов,треугольников$ вырезали девочки?$+,p2-p3,++",

"$w1,Юля,Настя,Маша,Оля,Арина$ купила $v1,12,13,14,15,16,17$  $w2, альбом_альбома_альбомов,кисточка_кисточки_кисточек$, $w3,фломастеров,карандашей$ на $v2,3,5,6,7,8,9,4$ больше, а ручек на $v3,10,9,8,7,11$ меньше, чем $w2, альбомов, фломастеров$. Сколько всего учебных предметов купила $w1,Юля,Настя,Маша,Оля,Арина$?$+,p2-p3,++",

"На ферме было всего $v3,150,155,156,270,284,286,287$ животных: $v1,45,56,75,67,57,58,59,87,76$  $w1,гусь_гуся_гусей,поросенок_поросёнка_поросенков,корова_коровы_коров$, кур было на $v2, 25,35,27,17,21,22,33$ меньше, чем $w1,гусей,поросят,коров$, остальные-утки. Сколько было уток?$-,-,-",

"В первый день $w1,путники,туристы,путешественники$ прошли $v1,42,40,41,43,44,45,46,47,48,49,50,51,52,53,53,54,55$ км, во второй день на $v2,10,11,12,13,14,15,16,17,18,20,21,22,23,24,25,26$ км меньше, а в третий день на $v3,5,6,7,8,9,10,3,4$ км больше, чем во второй. Сколько километров прошли $w1,путники,туристы,путешественники$  за три дня?$-,p2+p3,++",

"Для ремонта $a,детского сада,школы,здания$ купили $v3,50,55,56,70,84,86,87$ инструментов: $v1,15,16,17,18,19,20$  $a,молоток_молотка_молотков,отвертка_отвертки_отверток$, ножовок на $v2,3,4,5,6,7,8,2$ больше, остальные – рубанки. Сколько купили рубанков для ремонта?$+,-,-"

];







